app/Http/Controllers/Dashboard/AdminController.php

    public function index(){
        $admins = Admin::all();
---
select * from "admins"