app/Http/Controllers/Dashboard/LoginController.php

     public function postResetPassword(ForgetPasswordRequest $request ,$token){
         $check_token = DB::table('password_resets')->where('token', $token)->where('created_at', '>', Carbon::now()->subHours(2))->first();
         if (!empty($check_token)){
             $admin = Admin::where('email', $check_token->email)->update([
                        'email'=>$check_token->email,
                        'password'=>bcrypt(request('password')),
                 ]);
             DB::table('password_resets')->where('email', request('email'))->delete();
---
select * from "password_resets" where "token" = 'c1d6ddccdef99e12857a1c45d330f1636b50087bf6115f75d08a7bfba8d52de8' and "created_at" > '2020-11-12 16:59:43' limit 1
update "admins" set "email" = 'mostafa0alii@gmail.com', "password" = 'yDosDSqWSoPOAfQIofqwyu5UuScaa1KdLsfrsqXCje7sC3v63fbQS', "updated_at" = '2020-11-12 18:59:43' where "email" = 'mostafa0alii@gmail.com'
delete from "password_resets" where "email" = 'mostafa0alii@gmail.com'